In [1]:
# Import pandas
import pandas as pd

In [2]:
# Create a list of a data
data = [12,78,96,56,23,4,78,95,25]
data

[12, 78, 96, 56, 23, 4, 78, 95, 25]

In [4]:
# check data type
type(data)

list

### Series on dimentional and DataFrame two domentional

In [6]:
# Create a Series from the list 
series = pd.Series(data,name="number")
series

0    12
1    78
2    96
3    56
4    23
5     4
6    78
7    95
8    25
Name: number, dtype: int64

In [12]:
# Create a DataFrame from the series and list
# from series
df = pd.DataFrame(series)
df

   number
0      12
1      78
2      96
3      56
4      23
5       4
6      78
7      95
8      25

In [13]:
df = pd.DataFrame(data,columns=["Number"])
# show first 5 data use head()
df.head()

   Number
0      12
1      78
2      96
3      56
4      23

In [14]:
# Create a series fro 2 integers columns
# 2 columns and 4 rows
data = [[11,8],[8,9],[3,6],[12,8]]
data

[[11, 8], [8, 9], [3, 6], [12, 8]]

In [17]:
series = pd.Series(data)
series

0    [11, 8]
1     [8, 9]
2     [3, 6]
3    [12, 8]
dtype: object

In [18]:
# create a DataFrame the list and rename the columns
df = pd.DataFrame(data, columns=['number1', "number2"])
df

   number1  number2
0       11        8
1        8        9
2        3        6
3       12        8

In [20]:
# create a series from the DataFrame
sdf = df[["number1","number2"]]
sdf

   number1  number2
0       11        8
1        8        9
2        3        6
3       12        8

#### Dictionary to Series and DataFrame

In [21]:
# create a dictionary mother and daughter
data = {
    "name": ["Subena","Doha"],
    "age": [29,17],
    "city": ["Sylhet","Barishal"]
}
data

{'name': ['Subena', 'Doha'], 'age': [29, 17], 'city': ['Sylhet', 'Barishal']}

In [24]:
# Create a series from the dictionary
info = pd.Series(data["name"])
info

0    Subena
1      Doha
dtype: object

In [27]:
# Create a DataFrme from the Dictionary
infodf = pd.DataFrame(data)
infodf

     name  age      city
0  Subena   29    Sylhet
1    Doha   17  Barishal

In [28]:
infodf["age"]

0    29
1    17
Name: age, dtype: int64